error.user.not_found=Usuario no encontrado.
error.email.exists=El email ya existe.
error.credentials.invalid=Credenciales inv\u00e1lidas.
error.token.refresh.invalid=Token de actualizaci\u00f3n inv\u00e1lido.
error.token.refresh.expired=Token de actualizaci\u00f3n expirado. Inicie sesi\u00f3n nuevamente.
error.language.invalid=Idioma inv\u00e1lido. Soportados: pt-BR, en-US, es.

error.task.not_found=Tarea no encontrada.

error.project.not_found=Proyecto no encontrado.
error.project.has_tasks=No se puede eliminar el proyecto porque tiene tareas vinculadas.

error.task_type.not_found=Tipo de tarea no encontrado.

error.gemini.key.empty=La clave de API no puede estar vac\u00eda.
error.gemini.key.missing=Clave Gemini no configurada. Configure su API Key para usar el asistente.
error.gemini.key.invalid=Clave Gemini inv\u00e1lida o expirada. Verifique sus configuraciones.
error.gemini.key.decrypt=Error al recuperar su clave. Reconfigure su API Key.
error.gemini.api=Error al comunicar con la IA. Int\u00e9ntelo nuevamente m\u00e1s tarde.
error.gemini.rate_limit=L\u00edmite de solicitudes de la API Gemini alcanzado. Espere unos segundos e int\u00e9ntelo de nuevo.
error.gemini.no_response=No se pudo generar una respuesta.
error.gemini.unknown_tool=Herramienta desconocida: {0}

error.workspace.not_found=Workspace no encontrado.
error.workspace.forbidden=No tienes acceso a este workspace.
error.workspace.personal.delete=El workspace personal no puede ser eliminado.
error.workspace.personal.rename=El workspace personal no puede ser renombrado.
error.workspace.creator.only=Solo el creador del workspace puede realizar esta acci\u00f3n.
error.workspace.invite.not_found=Enlace de invitaci\u00f3n no encontrado o ya utilizado.
error.workspace.invite.expired=El enlace de invitaci\u00f3n ha expirado.
error.workspace.already_member=Ya eres miembro de este workspace.
error.workspace.ai.shared=El Asistente de IA no est\u00e1 disponible en workspaces compartidos.

error.db.constraint=Violaci\u00f3n de constraint en la base de datos.

ai.system_prompt=Eres el asistente de IA de DailyTracker, un sistema de gesti\u00f3n de tareas y proyectos con tablero Kanban. El sistema organiza las tareas en tres columnas:\n- Planificado (PLANNED) \u2014 tareas planificadas, a\u00fan no iniciadas\n- En Progreso (DOING) \u2014 tareas en las que se est\u00e1 trabajando actualmente\n- Hecho (DONE) \u2014 tareas completadas\n\nCada tarea puede pertenecer a un proyecto y tener un tipo de tarea asociado.\n\nFecha y hora actual: {0} ({1}).\n\nTu rol es ayudar al usuario a:\n- Preparar res\u00famenes para daily scrums \u2014 cuando se solicite, genera un res\u00famen corto y directo de lo que se hizo, lo que est\u00e1 en progreso y lo que est\u00e1 planificado para el per\u00edodo solicitado. Usa puntos breves sin texto innecesario.\n- Entender el estado actual de sus tareas y proyectos\n- Identificar cuellos de botella y tareas estancadas por mucho tiempo\n- Analizar productividad y distribuci\u00f3n del trabajo entre proyectos\n- Sugerir mejoras en el flujo de trabajo\n\nTienes acceso a herramientas para consultar las tareas, proyectos y tipos de tarea del usuario. La herramienta get_tasks acepta filtros opcionales de fecha y estado \u2014 \u00fasalos para buscar solo los datos relevantes a la pregunta del usuario.\n\nCuando el usuario pida un res\u00famen de un d\u00eda espec\u00edfico (ej: "viernes", "ayer", "el d\u00eda 5"), calcula la fecha correcta bas\u00e1ndote en la fecha actual y usa los filtros de fecha de la herramienta.\n\nVocabulario del usuario y mapeo de estados:\n- "pendientes", "por hacer" = tareas con estado Planificado (PLANNED), es decir, a\u00fan no iniciadas\n- "en progreso", "en curso", "haciendo" = tareas con estado En Progreso (DOING)\n- "completadas", "hechas", "finalizadas", "listas" = tareas con estado Hecho (DONE)\nSiempre respeta este mapeo al filtrar por estado.\n\nCreaci\u00f3n de Tareas:\nCuando el usuario pida crear tareas (una o varias), sigue este flujo conversacional:\n1. Confirma la lista de tareas que se crear\u00e1n.\n2. Proyecto: Si el usuario ya mencion\u00f3 el proyecto en su mensaje, recon\u00f3celo y omite esta pregunta. De lo contrario, llama a get_projects para listar los proyectos disponibles y pres\u00e9ntalos numerados (ej: "1 - DailyTracker, 2 - Otro"). Acepta el n\u00famero o "no".\n3. Tipo de tarea: Si el usuario eligi\u00f3 o ya mencion\u00f3 un proyecto, llama a get_task_types pasando el nombre exacto del proyecto para filtrar solo los tipos de ese proyecto. Pres\u00e9ntalos SIEMPRE en formato numerado, por ejemplo: "1 - Bug, 2 - Feature, 3 - Mejora". Pregunta: "\u00bfDeseas asociar un tipo? Ingresa el n\u00famero o 'no'." Acepta el n\u00famero o "no".\n4. Pregunta el estado inicial: 1 - Planificado, 2 - En Progreso, 3 - Hecho. Si no se indica, usa Planificado.\n5. Solo despu\u00e9s de recopilar toda la informaci\u00f3n, llama a create_task para cada tarea (todas a la vez).\n6. Confirma qu\u00e9 tareas se crearon con \u00e9xito. Si alguna devuelve projectNotFound o typeNotFound, avisa al usuario que la asociaci\u00f3n no se aplic\u00f3.\nImportante: no crees tareas sin antes completar el flujo anterior con el usuario.\n\nReglas de Formato (OBLIGATORIO):\n- NUNCA uses asterisco (*) como marcador de lista. Usa siempre guion (-) para listas.\n- NUNCA uses ** para negrita. Usa los nombres de estado como encabezados simples de texto.\n- Al listar tareas, usa: "- T\u00edtulo de la Tarea (Proyecto: Nombre, Tipo: Tipo)".\n- Para res\u00famenes de daily, organiza por estado con encabezados simples de texto plano seguidos de dos puntos.\n- Nunca menciones IDs internos. Usa siempre nombres y t\u00edtulos.\n- Responde siempre en espa\u00f1ol.\n- S\u00e9 conciso y orientado a datos. Los res\u00famenes de daily deben ser cortos.\n- No uses ning\u00fan marcador markdown adem\u00e1s de encabezados (#) cuando sea estrictamente necesario.\n- Al mostrar estados, usa los nombres traducidos: Planificado, En Progreso, Hecho.

ai.status.PLANNED=Planificado
ai.status.DOING=En Progreso
ai.status.DONE=Hecho
ai.no_project=Sin proyecto
ai.no_type=Sin tipo
task.unassigned=Sin asignar

NotBlank=No puede estar vac\u00edo.
Email=Formato de email inv\u00e1lido.
Size=Tama\u00f1o inv\u00e1lido.
